import React from "react";
import "./index.scss";

import MenuTitle from "../../components/MenuTitle";
import ShareLink from "../../components/ShareLink";

const AboutTheMinistry = () => {
  return (
    <div className="abouttheministry-container">
      <div className="abouttheministry-content">
        <div className="abouttheministry-title">
          <MenuTitle title="ВАЗИРЛИК ҲАҚИДА" />
        </div>
        <div className="abouttheministry-grid">
          <div>
            <h1>
              Ўзбекистон Республикаси <span>Халқ таълими вазирлиги</span>
            </h1>
            <h3>
              Ўзбекистон Республикаси Халқ таълими вазирлигининг асосий
              вазифалари ва фаолияти йўналишлари қуйидагилардир (ВМ қарори
              №146):
            </h3>
            <img
              src="https://uzedu.uz/uploads/2020/03/2k2a0336.jpg"
              alt="rasim"
              className="mobile-block"
            />
            <div className="abouttheministry-abz">
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
              <p>
                <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
                таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
                жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
                ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
              </p>
            </div>
          </div>
          <div>
            <img
              src="https://uzedu.uz/uploads/2020/03/2k2a0336.jpg"
              alt="rasim"
              className="pc-block"
            />
            <p>
              <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
              таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
              жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
              ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
            </p>
            <p>
              <i className="fas fa-check"></i>умумий ўрта ва мактабдан ташқари
              таълим соҳасида ўқувчиларнинг маънавий-ахлоқий, интеллектуал ва
              жисмоний ривожланиши даражасини янада юксалтиришга йўналтирилган
              ягона давлат сиёсатини ишлаб чиқиш ва амалга ошириш;
            </p>
          </div>
        </div>
        <ShareLink />
      </div>
    </div>
  );
};

export default AboutTheMinistry;
